import os
from pathlib import Path

ROOT_DIR = Path(__file__).resolve().parent.parent

DATA_DIR = ROOT_DIR / "data"
INBOX_DIR = DATA_DIR / "incoming_files" / "inbox"
PROCESSED_DIR = DATA_DIR / "processed_mails"

LOG_DIR = ROOT_DIR / "logs"
MODELS_DIR = ROOT_DIR / "models"


CATEGORIES = [
    "critical_incidents",   # Критические инциденты (сбои, падение систем, ошибка 500)
    "news",                 # Автоматические уведомления
    "spam_and_phishing",    # Спам и фишинговые атаки
    "routine_requests",     # Стандартные заявки рабочих процессов
    "outliers"              # Выбросы
]


# Ключевые слова и паттерны, классификация по ним
# Все слова и паттерны приводятся к нижнему регистру для универсального поиска.

KEYWORDS_CRITICAL = [
    "критичный инцидент", "критический инцидент", "ошибка 500", 
    "работа остановлена", "массовый сбой", "у всего отдела", 
    "не отвечает", "упала система", "падает система", "critical",
    "gateway не отвечает", "сбой авторизации"
]

KEYWORDS_AUTOMATED = [
    "плановый отчёт", "плановый отчет", "отчёт мониторинга", "отчет мониторинга",
    "корпоративный дайджест", "alert:", "warning:", "healthcheck", 
    "uptime", "cpu usage", "disk usage", "робот-информатор"
]

KEYWORDS_SPAM = [
    "выиграли iphone", "розыгрыш", "пароль истекает", "перейдите по ссылке", 
    "подтвердите личность", "введите данные", "банковской карты", 
    "зафиксирован подозрительный вход", "эксклюзивная акция", "вы стали победителем"
]

KEYWORDS_ROUTINE = [
    "запрос доступа", "нужны права", "выдать доступ", "восстановить доступ", "права в",
    "заявка на отпуск", "больничный лист", "период нетрудоспособности", "оформление нового",
    "неисправность оборудования", "гарнитура", "сканер", "ноутбук", "принтер", "мышь", 
    "сломался", "сломалась", "замена", "ремонт",
    "закрывающие документы", "акт выполненных работ", "счет на оплату", "счёт на оплату", 
    "уточнение по оплате", "согласование договора", "техническое задание"
]


# Формат логирования
LOG_FORMAT = "%(asctime)s [%(levelname)s] %(name)s: %(message)s"
LOG_FILE_PATH = LOG_DIR / "pipeline.log"